# Dotfiles Brewfile - macOS Dependencies
# Install with: brew bundle --file=Brewfile

# Core System Tools
brew "git"
brew "zsh"
brew "neovim"
brew "vim"
brew "tmux"

# Modern CLI Utilities
brew "ripgrep"       # Fast grep replacement
brew "fd"            # Fast find replacement
brew "fzf"           # Fuzzy finder
brew "bat"           # Cat with syntax highlighting
brew "eza"           # Modern ls replacement
brew "jq"            # JSON processor
brew "htop"          # Process viewer

# Development Tools
brew "mise"          # Version manager for programming languages
brew "gh"            # GitHub CLI

# TUI Tools
brew "gum"           # Shell scripting TUI primitives

# Databases
brew "postgresql"    # Latest version

# Docker (via colima instead of Docker Desktop)
brew "docker"        # Docker CLI
brew "docker-compose"
brew "colima"        # Container runtime

# Terminal Emulator
cask "alacritty"

# Editor
cask "visual-studio-code"

# AI Tools
cask "lm-studio"     # AI model runner

# Fonts
cask "font-fira-code-nerd-font"

# Maintenance
brew "topgrade"      # Universal updater
