# Dotfiles Brewfile - macOS Dependencies
# Install with: brew bundle --file=Brewfile

# Taps
tap "homebrew/cask-fonts"

# Core System Tools
brew "git"
brew "zsh"
brew "neovim"
brew "vim"
brew "tmux"

# Modern CLI Utilities
brew "ripgrep"       # Fast grep replacement
brew "fd"            # Fast find replacement
brew "fzf"           # Fuzzy finder
brew "bat"           # Cat with syntax highlighting
brew "eza"           # Modern ls replacement
brew "jq"            # JSON processor
brew "htop"          # Process viewer

# Development Tools
brew "mise"          # Version manager for programming languages
brew "gh"            # GitHub CLI
brew "gh-dash"       # GitHub Dashboard extension for gh

# Databases
brew "postgresql@15"

# Docker
cask "docker"

# Terminal Emulator
cask "alacritty"

# Editor
cask "visual-studio-code"

# Fonts
cask "font-fira-code-nerd-font"

# Maintenance
brew "topgrade"      # Universal updater
